[
    {
        "tags": [
            "foundation",
            "history",
            "date"
        ],
        "content": "Jamia Millia Islamia was founded on 29 October 1920.",
        "sources": [
            "turn0search1",
            "turn0search6"
        ]
    },
    {
        "tags": [
            "founders",
            "history",
            "people"
        ],
        "content": "Founding figures include Maulana Mahmud Hasan (Shaikhul Hind), Maulana Mohammad Ali Jauhar, Hakim Ajmal Khan, Dr. Mukhtar Ahmad Ansari, and Abdul Majeed Khwaja.",
        "sources": [
            "turn0search1",
            "turn0search11"
        ]
    },
    {
        "tags": [
            "central_university",
            "act",
            "law"
        ],
        "content": "Jamia Millia Islamia became a Central University by an Act of Parliament in December 1988 (The Jamia Millia Islamia Act, 1988).",
        "sources": [
            "turn1search3",
            "turn1search1"
        ]
    },
    {
        "tags": [
            "location",
            "campus",
            "address"
        ],
        "content": "Main campus is located in Jamia Nagar, Okhla, South East Delhi (New Delhi - 110025).",
        "sources": [
            "turn0search3",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "naac",
            "accreditation",
            "ranking"
        ],
        "content": "Jamia Millia Islamia received the highest grade 'A++' from the National Assessment and Accreditation Council (NAAC) in its second cycle of assessment (2021).",
        "sources": [
            "turn1search2",
            "turn1search9"
        ]
    },
    {
        "tags": [
            "nirf",
            "ranking",
            "2024"
        ],
        "content": "In NIRF 2024 (University category), Jamia Millia Islamia was ranked 3rd among universities in India.",
        "sources": [
            "turn0search0",
            "turn0search5"
        ]
    },
    {
        "tags": [
            "history",
            "relocation",
            "timeline"
        ],
        "content": "Jamia was established in Aligarh (1920), moved to Karol Bagh (Delhi) in 1925, and later to the present Okhla/Jamia Nagar campus (foundation stone at Okhla laid in 1935).",
        "sources": [
            "turn0search1",
            "turn0search6"
        ]
    },
    {
        "tags": [
            "faculties",
            "academics",
            "schools"
        ],
        "content": "JMI comprises multiple faculties, including Architecture & Ekistics, Dentistry, Education, Engineering & Technology, Fine Arts, Humanities & Languages, Law, Management Studies, Sciences, Life Sciences, and Social Sciences.",
        "sources": [
            "turn0search7",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "courses",
            "programs",
            "degrees"
        ],
        "content": "JMI offers undergraduate, postgraduate, and doctoral programs across arts, sciences, engineering, law, management, architecture, social sciences, and allied areas.",
        "sources": [
            "turn0search8",
            "turn0search7"
        ]
    },
    {
        "tags": [
            "research",
            "centres",
            "mcrc"
        ],
        "content": "Notable centres include the Anwar Jamal Kidwai Mass Communication Research Centre (MCRC) and the Centre for Theoretical Physics; JMI supports multiple research centres across disciplines.",
        "sources": [
            "turn0search1",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "student_body",
            "population",
            "statistics"
        ],
        "content": "JMI enrolls tens of thousands of students across undergraduate, postgraduate and doctoral programs (student counts vary by year).",
        "sources": [
            "turn1search7",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "sports",
            "grounds",
            "cricket"
        ],
        "content": "The campus includes the Nawab Mansoor Ali Khan Pataudi Sports Complex, which has hosted university-level and women's cricket matches.",
        "sources": [
            "turn0search1"
        ]
    },
    {
        "tags": [
            "alumni",
            "notable_people"
        ],
        "content": "Jamia Millia Islamia has a long list of notable alumni across public service, arts, media and politics — the university maintains lists of prominent alumni.",
        "sources": [
            "turn0search4",
            "turn0search9",
            "turn0search13"
        ]
    },
    {
        "tags": [
            "accreditation",
            "ugc",
            "affiliations"
        ],
        "content": "JMI is recognized by the University Grants Commission (UGC) and maintains affiliations and approvals across statutory professional bodies (AICTE, BCI, NMC, etc.) for relevant programs.",
        "sources": [
            "turn1search7",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "centenary",
            "milestone"
        ],
        "content": "Jamia celebrated its 100-year centenary in 2020 with events and campus commemorations in following years (centenary gate and related activities).",
        "sources": [
            "turn0search1",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "library",
            "donation",
            "king_abdullah"
        ],
        "content": "In 2006 King Abdullah of Saudi Arabia made a major donation to JMI which contributed to library and research infrastructure.",
        "sources": [
            "turn1search7"
        ]
    },
    {
        "tags": [
            "administration",
            "chancellor",
            "vc",
            "vice chancellor"
        ],
        "content": "The Vice Chancellor of Jamia Millia Islamia is the President of India; the university has a Chancellor and Vice-Chancellor as per statutory structure (these posts have changed holders over time). The current VC is Prof. Mazhar Asif.",
        "sources": [
            "turn1search7",
            "turn1search1"
        ]
    },
    {
        "tags": [
            "legal",
            "statutes",
            "act"
        ],
        "content": "The Jamia Millia Islamia Act, 1988 defines the university's governance, powers, and statutory bodies such as the Academic Council and Executive Council.",
        "sources": [
            "turn1search1",
            "turn1search3"
        ]
    },
    {
        "tags": [
            "admissions",
            "entrance",
            "test"
        ],
        "content": "Admission processes vary by faculty and program (some professional programs use university-specific entrance tests, others use national-level exams or merit-based selection).",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "infrastructure",
            "campus_expansion"
        ],
        "content": "JMI has expanded infrastructure over decades, adding hostels, labs, centres, and academic buildings across the Okhla campus and adjacent land parcels.",
        "sources": [
            "turn0search8",
            "turn0search6"
        ]
    },
    {
        "tags": [
            "medical_college",
            "approval",
            "news"
        ],
        "content": "Announcements and approvals for a medical college have appeared in university notices and media in recent years (check official sources for the latest status).",
        "sources": [
            "turn0search1"
        ]
    },
    {
        "tags": [
            "iqac",
            "quality",
            "ranking"
        ],
        "content": "The Internal Quality Assurance Cell (IQAC) at JMI monitors accreditation, quality processes and submissions to NAAC and ranking agencies.",
        "sources": [
            "turn1search0",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "international_relations",
            "mous"
        ],
        "content": "JMI has engaged in international collaborations and MoUs with foreign universities, though these partnerships change over time and have been adjusted or suspended based on institutional decisions.",
        "sources": [
            "turn0search8",
            "turn1news21"
        ]
    },
    {
        "tags": [
            "digital_initiative",
            "e-governance"
        ],
        "content": "Jamia has been modernizing administrative processes and digital services for students and staff (e.g., online forms, portals and digital notices).",
        "sources": [
            "turn0search8",
            "turn1news28"
        ]
    },
    {
        "tags": [
            "ranking_history",
            "nirf_trend"
        ],
        "content": "Jamia's NIRF ranking has improved over the past decade; it moved from lower rankings to a top-5 university position in recent NIRF cycles prior to 2024.",
        "sources": [
            "turn0search5",
            "turn0search0"
        ]
    },
    {
        "tags": [
            "language",
            "motto"
        ],
        "content": "JMI's motto is from the Qur'an in Arabic; the university uses both English and Hindi on official platforms.",
        "sources": [
            "turn1search7",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "community",
            "mission"
        ],
        "content": "Jamia Millia Islamia was established with the goal of providing a national (millia) university and promoting education for social upliftment, emphasizing secular and inclusive education.",
        "sources": [
            "turn0search6",
            "turn0search1"
        ]
    },
    {
        "tags": [
            "continuing_education",
            "extension"
        ],
        "content": "The university conducts extension programs, workshops, symposia, and continuing-education courses for broader engagement beyond core degree programs.",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "public_relations",
            "press"
        ],
        "content": "The JMI Public Relations Office issues press releases on rankings, accreditations, events and official decisions; these are authoritative for university announcements.",
        "sources": [
            "turn0search0",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "affiliations",
            "academic_bodies"
        ],
        "content": "Jamia is a member of academic bodies and councils such as the Association of Commonwealth Universities (ACU) and Association of Indian Universities (AIU).",
        "sources": [
            "turn1search7",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "campus_life",
            "hostels"
        ],
        "content": "The university provides multiple hostels for male and female students, student societies, clubs, and cultural activities across campus.",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "library",
            "resources"
        ],
        "content": "JMI's central library and departmental libraries support teaching and research; modernizations and expansions have been part of campus plans.",
        "sources": [
            "turn0search8",
            "turn1search7"
        ]
    },
    {
        "tags": [
            "examinations",
            "results"
        ],
        "content": "Exam schedules, results and related academic notices are published on the university portal and official circulars.",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "governance",
            "bodies"
        ],
        "content": "Key governing bodies include the University Court, Executive Council, Academic Council and Finance Committee as laid out in the Jamia Act and Statutes.",
        "sources": [
            "turn1search1",
            "turn1search3"
        ]
    },
    {
        "tags": [
            "social_impact",
            "outreach"
        ],
        "content": "Through its programs and alumni, JMI contributes to public life, media, administration and the arts in India.",
        "sources": [
            "turn0search4",
            "turn0search9"
        ]
    },
    {
        "tags": [
            "contacts",
            "phone",
            "address"
        ],
        "content": "Official contact: Jamia Millia Islamia, Jamia Nagar, New Delhi-110025, phone numbers and contact details available on the university website.",
        "sources": [
            "turn0search3",
            "turn0search8"
        ]
    },
    {
        "tags": [
            "events",
            "conferences"
        ],
        "content": "The university hosts national and international conferences, symposia and cultural festivals through its departments and centres.",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "innovation",
            "incubation"
        ],
        "content": "JMI supports research, innovation and some incubation activities via university departments and technology/entrepreneurship initiatives.",
        "sources": [
            "turn0search8"
        ]
    },
    {
        "tags": [
            "legal_status",
            "minority",
            "courts"
        ],
        "content": "Legal and policy questions about minority status, governance and statutory powers have been the subject of public documents and judicial review in some cases (see official acts and court records).",
        "sources": [
            "turn1search10",
            "turn1search12"
        ]
    },
    {
        "tags": [
            "media_coverage",
            "news"
        ],
        "content": "The university is frequently covered in national media for rankings, policy decisions, campus events and governance matters.",
        "sources": [
            "turn0search1",
            "turn0search8",
            "turn0news50"
        ]
    }
]